{"backend": "tensorflow", "config": {"layers": [{"config": {"batch_input_shape": [null, 80, 80], "data_format": "channels_last", "dtype": "float32", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_2", "bias_regularizer": null, "dtype": "float32", "trainable": true, "use_bias": true, "units": 128, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_3", "bias_regularizer": null, "dtype": "float32", "trainable": true, "use_bias": true, "units": 44, "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4-tf", "class_name": "Sequential"}