{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential", "layers": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [5, 5], "bias_constraint": null, "dtype": "float32", "batch_input_shape": [null, 80, 80, 1], "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "name": "conv2d", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [5, 5], "bias_constraint": null, "dtype": "float32", "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_1", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "dtype": "float32", "data_format": "channels_last", "name": "max_pooling2d", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "rate": 0.25, "dtype": "float32", "name": "dropout", "trainable": true}}, {"class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "relu", "units": 128, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "dense", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "rate": 0.5, "dtype": "float32", "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "softmax", "units": 44, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null}}]}, "keras_version": "2.2.4-tf"}