{"keras_version": "2.2.4-tf", "config": {"layers": [{"config": {"dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "padding": "valid", "batch_input_shape": [null, 80, 80, 1], "bias_regularizer": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "filters": 32, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "kernel_size": [5, 5], "kernel_regularizer": null, "name": "conv2d", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "padding": "valid", "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "strides": [1, 1], "trainable": true, "filters": 64, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "kernel_size": [5, 5], "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d", "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout", "dtype": "float32", "noise_shape": null, "rate": 0.25, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "flatten", "data_format": "channels_last", "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "units": 128, "name": "dense", "dtype": "float32", "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "dtype": "float32", "noise_shape": null, "rate": 0.5, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "units": 44, "name": "dense_1", "dtype": "float32", "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "softmax"}, "class_name": "Dense"}], "name": "sequential"}, "class_name": "Sequential", "backend": "tensorflow"}