{"keras_version": "2.2.4-tf", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Flatten", "config": {"dtype": "float32", "batch_input_shape": [null, 80, 80], "name": "flatten", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "units": 128, "bias_constraint": null, "name": "dense", "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "units": 44, "bias_constraint": null, "name": "dense_1", "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "softmax", "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null}}], "name": "sequential"}}